0.03 0
batchsize = 300  epoch = 150
{"config": [{"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 48, 48, 1], "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "relu", "padding": "valid", "kernel_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "valid", "kernel_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "name": "conv2d_4", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "name": "conv2d_5", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "name": "conv2d_6", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "name": "conv2d_7", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_7", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_size": [3, 3], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "name": "conv2d_8", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_4", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_8", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_9", "trainable": true, "rate": 0.45}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "units": 1024, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_10", "trainable": true, "rate": 0.45}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_constraint": null, "units": 7, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "theano", "class_name": "Sequential", "keras_version": "2.0.3"}