{"config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "filters": 2, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 48, 48, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "name": "conv2d_1", "dtype": "float32", "activation": "relu", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "filters": 10, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_2", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "filters": 20, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_3", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 64, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 70, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 80, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 88, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 96, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 7, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "softmax", "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "trainable": true}}], "backend": "theano", "class_name": "Sequential", "keras_version": "2.0.3"}