{"class_name": "Sequential", "backend": "theano", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "filters": 25, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_2", "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "filters": 50, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_3", "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "filters": 100, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_4", "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "filters": 200, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 400, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 7, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}], "keras_version": "2.0.3"}