{"keras_version": "2.0.3", "config": [{"config": {"name": "conv2d_1", "use_bias": true, "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "filters": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "use_bias": true, "activation": "relu", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "filters": 20, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 70, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 80, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 88, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_5", "use_bias": true, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 7, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "theano"}