0.06 42
batchsize = 600  epoch = 50
{"class_name": "Sequential", "keras_version": "2.0.3", "backend": "theano", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "dtype": "float32", "units": 800, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "batch_input_shape": [null, 2304], "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.45}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_2", "trainable": true, "units": 1600, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_3", "trainable": true, "units": 7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}}]}