0.06 0
batchsize = 600  epoch = 10
{"config": [{"config": {"trainable": true, "kernel_constraint": null, "name": "conv2d_13", "batch_input_shape": [null, 48, 48, 1], "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 16}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_13", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_13", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "name": "conv2d_14", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 32}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_14", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_14", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_7", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_13", "activity_regularizer": null, "units": 400, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_14", "activity_regularizer": null, "units": 7, "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}