0.06 0
batchsize = 600  epoch = 80
{"keras_version": "2.0.3", "backend": "tensorflow", "config": [{"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 32, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 48, 48, 1], "padding": "valid", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_6", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "dropout_5", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_7", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_6", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "units": 800, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "units": 7, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}