0.06 0
batchsize = 600  epoch = 1
{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "dtype": "float32", "padding": "valid", "use_bias": true, "filters": 16, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "batch_input_shape": [null, 48, 48, 1], "data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 40, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 7, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "softmax", "trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.3"}