
{"config": [{"config": {"name": "conv2d_1", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "activation": "relu", "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_2", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "activation": "relu", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_4", "activation": "relu", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "activation": "relu", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_5", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_6", "activation": "relu", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_6", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_7", "activation": "relu", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_7", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_8", "activation": "relu", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_8", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "units": 800, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "softmax", "units": 7, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}