0.06 0
batchsize = 600  epoch = 100
{"config": [{"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 48, 48, 1], "padding": "valid", "dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 32, "name": "conv2d_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 32, "name": "conv2d_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 64, "name": "conv2d_3", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 64, "name": "conv2d_4", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 128, "name": "conv2d_5", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 128, "name": "conv2d_6", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.3, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 256, "name": "conv2d_7", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "filters": 256, "name": "conv2d_8", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.3, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 800, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 7, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.3", "class_name": "Sequential", "backend": "tensorflow"}