0.06 0
batchsize = 600  epoch = 1
{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "activation": "relu", "bias_constraint": null, "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 16, "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 40, "name": "dense_3", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 7, "name": "dense_4", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}], "keras_version": "2.0.3"}