0.06 0
batchsize = 600  epoch = 1
{"config": [{"config": {"bias_regularizer": null, "padding": "valid", "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": null, "name": "conv2d_6", "dtype": "float32", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "filters": 16, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.3, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_6", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_11", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "units": 40, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_12", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "trainable": true, "units": 7, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Sequential"}